[
  {
    "content": "mấy hôm k vào đc game cứ vào là văng",
    "score": 1,
    "date": "19/08/2025",
    "day_of_week": "Tue",
    "process": "k game",
    "label": "game problem"
  },
  {
    "content": "OPEN SUPERCELL STORE IN MY COUNTRY PLS I WILL FIX THIS TO 5 STARS",
    "score": 1,
    "date": "18/08/2025",
    "day_of_week": "Mon",
    "process": "open store in my country i will fix this to",
    "label": "feature request"
  },
  {
    "content": "Please Delete my save in the next hour or I will spam one star review make this your top priority",
    "score": 1,
    "date": "2025-08-17 22:31:27 UTC",
    "day_of_week": "Sun",
    "process": "please delete my save in the next hour or i will one star review make this your top priority",
    "label": "game not working"
  },
  {
    "content": "Top tier mobile game I think clash of clans has come a long way. There’s still a lot that can be fixed but compared to other old in app purchase long term playing games like Madden mobile, clash has tried to retain gameplay and give players the opportunity to have fun and win without investing a ton of money in it. And compensate in game.",
    "score": 5,
    "date": "2025-08-17 19:33:05 UTC",
    "day_of_week": "Sun",
    "process": "top tier mobile game i think clash of come a long way. still a lot that can be fixed but to other old in purchase long term like madden mobile, clash tried to retain and give the opportunity to have fun and win without a ton of money in it. and compensate in game.",
    "label": "positive feedback"
  },
  {
    "content": "Fun It is so fun to create a clan and watch it grow. Or you can join a clan and make new friends. Loafing on everyday is fun. Roar",
    "score": 5,
    "date": "2025-08-17 18:27:43 UTC",
    "day_of_week": "Sun",
    "process": "fun it is so fun to create a clan and watch it grow. or you can join a clan and make new loafing on everyday is fun. roar",
    "label": "positive feedback"
  },
  {
    "content": "Game issue I tired to delete my account to restart and when I got back on the loading screen it just never let me make a new account fix pls I wanna play",
    "score": 1,
    "date": "2025-08-17 16:27:09 UTC",
    "day_of_week": "Sun",
    "process": "game issue i tired to delete my account to restart and when i got back on the loading screen it just never let me make a new account fix i play",
    "label": "game problem"
  },
  {
    "content": "What is going on? Why is it every time I start an upgrade or do something the game erases everything I have done every single time I play. It makes me start over and over!  Like make it stop!!!!\nI really like the game but it has gotten a bit boring as well. \nDoes this even get read by the developers?",
    "score": 1,
    "date": "2025-08-17 15:59:19 UTC",
    "day_of_week": "Sun",
    "process": "what is going on? why is it every time i start an upgrade or do something the game everything i have done every single time i play. it me start over and over! like make it stop!!!! i really like the game but it gotten a bit boring as well. does this even get read by the",
    "label": "game not working"
  },
  {
    "content": "Gameplay Game has been good for a long time but this extra stuff is just that, extra..",
    "score": 5,
    "date": "2025-08-17 15:32:24 UTC",
    "day_of_week": "Sun",
    "process": "game been good for a long time but this extra stuff is just that, extra..",
    "label": "game problem"
  },
  {
    "content": "very harmful company. toxic and harmful. no more faith in this company anymore, i am quitting this game.",
    "score": 1,
    "date": "2025-08-17 14:08:08 UTC",
    "day_of_week": "Sun",
    "process": "very harmful company. toxic and harmful. no more faith in this company i am this game.",
    "label": "game not working"
  },
  {
    "content": "I can’t play So I wanted to re start in this back at town hall 1 so I deleted my world and now no matter what I do I cannot play anymore and it’s very frustrating because I’d love to play but you’re system is terrible",
    "score": 1,
    "date": "2025-08-17 07:52:01 UTC",
    "day_of_week": "Sun",
    "process": "i play so i to re start in this back at town hall so i my world and now no matter what i do i cannot play and very because love to play but system is terrible",
    "label": "game not working"
  },
  {
    "content": "customer service is not active? I have sent a message about my account and requested assistance for recovery but customer service representative haven't answered any of my questions",
    "score": 1,
    "date": "2025-08-17 06:04:17 UTC",
    "day_of_week": "Sun",
    "process": "customer service is not active? i have sent a message about my account and assistance for recovery but customer service representative any of my",
    "label": "game not working"
  },
  {
    "content": "Hog rider Hooooooooooooooooooooooooooooooooooooog Riderrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr",
    "score": 5,
    "date": "2025-08-17 04:53:08 UTC",
    "day_of_week": "Sun",
    "process": "hog rider",
    "label": "off-topic joke"
  },
  {
    "content": "Bonus road I finished the bonus road, and it is not infinite, and will only give a certain amount of currency. This is not good. I have 39000 flamingos yet I cannot use them for anything more. There is no point",
    "score": 3,
    "date": "2025-08-17 03:26:32 UTC",
    "day_of_week": "Sun",
    "process": "bonus road i finished the bonus road, and it is not infinite, and will only give a certain amount of currency. this is not good. i have yet i cannot use them for anything more. there is no point",
    "label": "game not working"
  },
  {
    "content": "10 This game goes on forever and ever and it’s very very fun to play. All you have to do is upgrade your town Townhall get in a clan and fight off other people and you can go to the solo mode and you can fight off the goblins.",
    "score": 5,
    "date": "2025-08-16 17:10:18 UTC",
    "day_of_week": "Sat",
    "process": "this game goes on forever and ever and very very fun to play. all you have to do is upgrade your town get in a clan and fight off other people and you can go to the solo mode and you can fight off the",
    "label": "positive feedback"
  },
  {
    "content": "Makes me not play and hate the game when I am trying to practice against townhall 11’s which is what Mine is and I get literally 60 town hall 12’s in a row trying to try different attacks",
    "score": 1,
    "date": "2025-08-16 16:54:43 UTC",
    "day_of_week": "Sat",
    "process": "me not play and hate the game when i am trying to practice against which is what mine is and i get literally town hall in a row trying to try different",
    "label": "game not working"
  },
  {
    "content": "Dis game ahh Dih gam ahh ion Ike it",
    "score": 1,
    "date": "2025-08-16 15:23:48 UTC",
    "day_of_week": "Sat",
    "process": "dis game gam ion it",
    "label": "game not working"
  },
  {
    "content": "Best gam I can’t get off this game it’s just too good",
    "score": 5,
    "date": "2025-08-16 14:11:38 UTC",
    "day_of_week": "Sat",
    "process": "best gam i get off this game just too good",
    "label": "positive feedback"
  },
  {
    "content": "HOG RIDAAA! Dude playing this game brings so much nostalgia",
    "score": 5,
    "date": "2025-08-16 13:51:36 UTC",
    "day_of_week": "Sat",
    "process": "hog dude this game so much nostalgia",
    "label": "positive feedback"
  },
  {
    "content": "Deleted my account I had a fully upgraded town hall 12 but they took it down",
    "score": 3,
    "date": "2025-08-16 12:15:15 UTC",
    "day_of_week": "Sat",
    "process": "my account i had a fully town hall but they took it down",
    "label": "game not working"
  },
  {
    "content": "Good game Very good game I recommend",
    "score": 5,
    "date": "2025-08-16 04:46:56 UTC",
    "day_of_week": "Sat",
    "process": "good game very good game i recommend",
    "label": "positive feedback"
  },
  {
    "content": "My idea about COC It is a very entertaining and fun game it addict you to itself and it is a good source to spend our free time. \nBut the only problem it that someone who work for 7or 8 years on his village suddenly it banned forever and all of the attempts and time that someone spend on this game will fade away and destroy. \nI want from supercell don’t do this cause that person won’t play again COC. 👊",
    "score": 2,
    "date": "2025-08-16 03:06:11 UTC",
    "day_of_week": "Sat",
    "process": "my idea about it is a very entertaining and fun game it addict you to itself and it is a good source to spend our free time. but the only problem it that someone who work for on his village suddenly it forever and all of the and time that someone spend on this game will fade away and destroy. i want from do this cause that person play again",
    "label": "game problem"
  },
  {
    "content": "Fix your game it’s been years it’s not that hard If I could 0 stars Fix the problem for deleting the world to be able to start over and it just says account deletion and doesn’t let you ever touch the game again",
    "score": 1,
    "date": "2025-08-15 17:48:20 UTC",
    "day_of_week": "Fri",
    "process": "fix your game been not that hard if i could fix the problem for the world to be able to start over and it just account deletion and let you ever touch the game again",
    "label": "feature request"
  },
  {
    "content": "😈 Love this event, feel like they should keep letting us use our hero’s while upgrading. In compromise make it coast a little more and take a little longer to upgrade, would be well worth it!",
    "score": 5,
    "date": "2025-08-15 13:26:37 UTC",
    "day_of_week": "Fri",
    "process": "love this event, feel like they should keep us use our while in compromise make it coast a little more and take a little longer to upgrade, would be well worth it!",
    "label": "positive feedback"
  },
  {
    "content": "Worst contact support If your clan is hacked they won’t be much help, just say have leader contact them. When they kicked out our original leader and have a new person be our leader who started kicking everyone out, changed our setting to raciest remarks, demoted everyone except their accounts. No HELP!",
    "score": 1,
    "date": "2025-08-15 12:14:11 UTC",
    "day_of_week": "Fri",
    "process": "worst contact support if your clan is hacked they be much help, just say have leader contact them. when they out our original leader and have a new person be our leader who kicking everyone out, our setting to everyone except their no help!",
    "label": "game not working"
  },
  {
    "content": "No control I’ve been playing this game for years and finally hit 5k trophies playing this event. I was excited until I found I was stuck in legends and now can’t play my favorite game as much as I’d liked with my friends. Leaving this review to say I’ll be deleting the game until a friend tells me this is fixed.",
    "score": 1,
    "date": "2025-08-15 11:47:59 UTC",
    "day_of_week": "Fri",
    "process": "no control been this game for and finally hit this event. i was excited until i found i was stuck in and now play my favorite game as much as with my leaving this review to say be the game until a friend me this is fixed.",
    "label": "game problem"
  },
  {
    "content": "skilled game A very nice skilled game where you have to place all of your troops completely pixel perfect and if you miss one pixel, your healer is gonna go for the clone that’s taking no damage",
    "score": 1,
    "date": "2025-08-15 09:30:16 UTC",
    "day_of_week": "Fri",
    "process": "skilled game a very nice skilled game where you have to place all of your completely perfect and if you miss one your healer is go for the clone taking no damage",
    "label": "positive feedback"
  },
  {
    "content": "cool I really liked making my own clan, and playing with friends. building my own village and really liked it, the hard work you put into it is amazing and worth it as well.",
    "score": 5,
    "date": "2025-08-15 06:39:37 UTC",
    "day_of_week": "Fri",
    "process": "cool i really making my own clan, and with building my own village and really it, the hard work you put into it is amazing and worth it as well.",
    "label": "positive feedback"
  },
  {
    "content": "Review This game is well worth the time!",
    "score": 5,
    "date": "2025-08-15 02:36:35 UTC",
    "day_of_week": "Fri",
    "process": "review this game is well worth the time!",
    "label": "positive feedback"
  },
  {
    "content": "why clash of clans is the goat crazy gameplay",
    "score": 5,
    "date": "2025-08-15 02:06:30 UTC",
    "day_of_week": "Fri",
    "process": "why clash of is the goat crazy",
    "label": "game not working"
  },
  {
    "content": "Ok I’ll stop Person 1: Oh no! The rival clans are fighting!\nPerson 2: What should we call this conflict? \nPerson 1: Idk, a Clash Of Clans?\n\n  Absolute Cinema ✋😐✋",
    "score": 5,
    "date": "2025-08-15 00:57:52 UTC",
    "day_of_week": "Fri",
    "process": "stop person oh no! the rival are fighting! person what should we call this conflict? person a clash of absolute cinema",
    "label": "off-topic joke"
  },
  {
    "content": "Amazing game one of the best games I have ever played I have played this game for 5 years and it still amazes me how much time and effort the developers put into the experience and events and it never gets old",
    "score": 5,
    "date": "2025-08-14 21:36:46 UTC",
    "day_of_week": "Thu",
    "process": "amazing game one of the best i have ever i have this game for and it still me how much time and effort the put into the experience and and it never old",
    "label": "positive feedback"
  },
  {
    "content": "Amazing game It’s a very nice game I like it very much and it’s so cool and I like it",
    "score": 5,
    "date": "2025-08-14 19:48:56 UTC",
    "day_of_week": "Thu",
    "process": "amazing game a very nice game i like it very much and so cool and i like it",
    "label": "positive feedback"
  },
  {
    "content": "Decent game It’s a very fun game to play but the wait to upgrade every is insane, it can take several days even a week to upgrade things I wish they would reduce wait time down to a few hours or a day at most, other than that it’s a really solid game that gets regular updates",
    "score": 4,
    "date": "2025-08-14 19:21:24 UTC",
    "day_of_week": "Thu",
    "process": "decent game a very fun game to play but the wait to upgrade every is insane, it can take several days even a week to upgrade i wish they would reduce wait time down to a few or a day at most, other than that a really solid game that regular",
    "label": "positive feedback"
  },
  {
    "content": "Perfect! This game is awesome really good and better then rise of kingdom!",
    "score": 5,
    "date": "2025-08-14 17:44:50 UTC",
    "day_of_week": "Thu",
    "process": "perfect! this game is awesome really good and better then rise of kingdom!",
    "label": "positive feedback"
  },
  {
    "content": "Deceptive practices I’ve been playing this game for 12 1/2 years ever since they dropped the troop training time. I’ve actually been trying to max out my base whenever you purchase something and keep it in your inventory. They force you to reach out to them multiple times to be able to activate something you’re already paid for. I would recommend taking screenshots of any purchases and wait until there after the class action lawsuit is finished to get reimbursed, similar to Fortnite",
    "score": 2,
    "date": "2025-08-14 17:34:19 UTC",
    "day_of_week": "Thu",
    "process": "deceptive been this game for ever since they the troop training time. actually been trying to out my base whenever you purchase something and keep it in your inventory. they force you to reach out to them multiple times to be able to activate something already for. i would recommend taking of any and wait until there after the class action lawsuit is finished to get similar to",
    "label": "game problem"
  },
  {
    "content": "Pay to progress Pay to progress",
    "score": 1,
    "date": "2025-08-14 15:32:57 UTC",
    "day_of_week": "Thu",
    "process": "pay to progress pay to progress",
    "label": "positive feedback"
  },
  {
    "content": "Funtime I enjoyed  playing this game on my off time",
    "score": 5,
    "date": "2025-08-14 14:46:42 UTC",
    "day_of_week": "Thu",
    "process": "i this game on my off time",
    "label": "positive feedback"
  },
  {
    "content": "Fix your game why am i a townhall 13 losing 33 trophies  when being  attacked by a townhall higher then me. but when i 3 star a townhall higher then me i get 13 trophies. i have to attack 5-6 times js so i dont loose the progress i made in one defense 🤦🏽‍♂️",
    "score": 1,
    "date": "2025-08-14 14:28:48 UTC",
    "day_of_week": "Thu",
    "process": "fix your game why am i a losing when being by a higher then me. but when i star a higher then me i get i have to attack times so i dont loose the progress i made in one defense",
    "label": "game not working"
  },
  {
    "content": "This game buns The tutorial is to hard😭😭😭😭😭😭😭😭😭😭",
    "score": 1,
    "date": "2025-08-14 13:59:39 UTC",
    "day_of_week": "Thu",
    "process": "this game the tutorial is to",
    "label": "game problem"
  },
  {
    "content": "Game lỗi Càng ngày game càng chán ở sảnh ko sao tìm trận ko nổi vậy có cho ngkh chs nữa ko",
    "score": 1,
    "date": "2025-08-14 12:40:38 UTC",
    "day_of_week": "Thu",
    "process": "game game ko sao ko cho ko",
    "label": "positive feedback"
  },
  {
    "content": "Great game but too many cheaters Great game but too many cheaters",
    "score": 1,
    "date": "2025-08-14 12:01:30 UTC",
    "day_of_week": "Thu",
    "process": "great game but too many great game but too many",
    "label": "game problem"
  },
  {
    "content": "Absolute cinema I raided some guys gold and took everything he had. Then I went home and played clash of clans",
    "score": 5,
    "date": "2025-08-14 03:42:49 UTC",
    "day_of_week": "Thu",
    "process": "absolute cinema i some gold and took everything he had. then i went home and clash of",
    "label": "feature request"
  },
  {
    "content": "So pay to win I’ve had my acount for a long time and I’ve noticed it’s a big money trap you pay for gems and you can what just upgrade stuff like the should make gems worth more but over all it’s a good game",
    "score": 4,
    "date": "2025-08-14 03:39:36 UTC",
    "day_of_week": "Thu",
    "process": "so pay to win had my for a long time and a big money trap you pay for and you can what just upgrade stuff like the should make worth more but over all a good game",
    "label": "game problem"
  },
  {
    "content": "The best game The best mobile game ever fun exciting and you get into your brain to do more stuff and make your attack strategy and base",
    "score": 5,
    "date": "2025-08-14 01:20:27 UTC",
    "day_of_week": "Thu",
    "process": "the best game the best mobile game ever fun exciting and you get into your brain to do more stuff and make your attack strategy and base",
    "label": "positive feedback"
  },
  {
    "content": "Best game ever Best game I ever played",
    "score": 5,
    "date": "2025-08-13 22:30:48 UTC",
    "day_of_week": "Wed",
    "process": "best game ever best game i ever",
    "label": "positive feedback"
  },
  {
    "content": "Awesome game! I’ve been playing this game for a while and loving it, but the only thing wrong is that I can’t trade my spare cosmetics to my alt. The only other thing I think this game would need is a way to trade SuperCell friends cosmetics, such as hero skins, village backgrounds and bought clan house parts.",
    "score": 5,
    "date": "2025-08-13 22:04:28 UTC",
    "day_of_week": "Wed",
    "process": "awesome game! been this game for a while and loving it, but the only thing wrong is that i trade my spare to my alt. the only other thing i think this game would need is a way to trade such as hero village and bought clan house",
    "label": "positive feedback"
  },
  {
    "content": "Love it My favorite game because it’s fun",
    "score": 5,
    "date": "2025-08-13 21:57:53 UTC",
    "day_of_week": "Wed",
    "process": "love it my favorite game because fun",
    "label": "positive feedback"
  },
  {
    "content": "Amazing Started yesterday and already addicted such a fun game",
    "score": 5,
    "date": "2025-08-13 17:46:40 UTC",
    "day_of_week": "Wed",
    "process": "amazing yesterday and already addicted such a fun game",
    "label": "positive feedback"
  },
  {
    "content": "Supercell fix it Never come across such bad PvP match ups in any game, sadly been like this for years. I kept trying to give them a shot and it only gets worse each time I try",
    "score": 1,
    "date": "2025-08-13 15:17:44 UTC",
    "day_of_week": "Wed",
    "process": "fix it never come across such bad match in any game, sadly been like this for i kept trying to give them a shot and it only worse each time i try",
    "label": "game not working"
  },
  {
    "content": "Game Pretty good game I like playing this game a lot lol",
    "score": 4,
    "date": "2025-08-13 13:39:28 UTC",
    "day_of_week": "Wed",
    "process": "game pretty good game i like this game a lot",
    "label": "positive feedback"
  },
  {
    "content": "Great game! Best mobile game to exist",
    "score": 5,
    "date": "2025-08-13 13:39:10 UTC",
    "day_of_week": "Wed",
    "process": "great game! best mobile game to exist",
    "label": "positive feedback"
  },
  {
    "content": "Best game I’ve ever played I’ve played clash for more than 10 years now and it has been my favorite game to play in any free time I get I’m a TH 16 and I’m on the grind to finally max out my base I would highly recommend it to anyone into strategy games even for the casually free to play player the game is still very fun",
    "score": 5,
    "date": "2025-08-13 13:13:02 UTC",
    "day_of_week": "Wed",
    "process": "best game ever clash for more than now and it been my favorite game to play in any free time i get a th and on the grind to finally out my base i would highly recommend it to anyone into strategy even for the casually free to play player the game is still very fun",
    "label": "positive feedback"
  },
  {
    "content": "Amazing Game, but needs some edits here and there. Dark Elixer is kind of just an extra resource. The game could be the same if it was just gold or normal elixer. Also hero levels are wayyy too high.It should just be like 5 levels per hero every TH. Plus, equipment has lowered the importance of these upgrades to begin with",
    "score": 5,
    "date": "2025-08-13 12:00:51 UTC",
    "day_of_week": "Wed",
    "process": "amazing game, but needs some here and there. dark is kind of just an extra resource. the game could be the same if it was just gold or normal also hero are too should just be like per hero every th. plus, equipment the importance of these to begin with",
    "label": "feature request"
  },
  {
    "content": "My opinion When I was a kid, I was downloading every game I see but when I downloaded this game I liked it because it was chill, and now it’s fighting more than waiting,some players like that so I won’t say this is bad,I still want to play (clash) and (clash dash),”please bring it back” and you need to Know that I give 5 stars to any game even if it didn’t deserve it \nP.S:Thanks for listening",
    "score": 5,
    "date": "2025-08-13 11:58:20 UTC",
    "day_of_week": "Wed",
    "process": "my opinion when i was a i was every game i see but when i this game i it because it was chill, and now fighting more than like that so i say this is still want to play and bring it and you need to know that i give to any game even if it deserve it for listening",
    "label": "game not working"
  },
  {
    "content": "Banned I’d like to talk to someone about my account. Nothing I’ve tried has worked",
    "score": 1,
    "date": "2025-08-13 10:57:23 UTC",
    "day_of_week": "Wed",
    "process": "like to talk to someone about my account. nothing tried worked",
    "label": "game not working"
  },
  {
    "content": "They’ll just delete your account after a while and give you no compensation Read title",
    "score": 1,
    "date": "2025-08-13 09:01:17 UTC",
    "day_of_week": "Wed",
    "process": "just delete your account after a while and give you no compensation read title",
    "label": "feature request"
  },
  {
    "content": "Same deck Everybody uses same troops. Dragons & lighting. Lame",
    "score": 4,
    "date": "2025-08-13 07:48:13 UTC",
    "day_of_week": "Wed",
    "process": "same deck everybody same lighting. lame",
    "label": "game not working"
  },
  {
    "content": ". game fell off, devs got uber greedy and it is impossible to consistently progress without spending money",
    "score": 1,
    "date": "2025-08-13 03:08:41 UTC",
    "day_of_week": "Wed",
    "process": "game fell off, got greedy and it is impossible to consistently progress without spending money",
    "label": "game not working"
  },
  {
    "content": "Amazing Game I spent a lot of my time playing clash of clans. Life can move past but this game can keep me grounded like my peace. Very blessed to be living in a time with this game. Where I would be without clash of clans",
    "score": 5,
    "date": "2025-08-13 00:06:24 UTC",
    "day_of_week": "Wed",
    "process": "amazing game i spent a lot of my time clash of life can move past but this game can keep me grounded like my peace. very blessed to be living in a time with this game. where i would be without clash of",
    "label": "positive feedback"
  },
  {
    "content": "A fun game It’s such a good game for kids",
    "score": 5,
    "date": "2025-08-12 22:12:21 UTC",
    "day_of_week": "Tue",
    "process": "a fun game such a good game for",
    "label": "positive feedback"
  },
  {
    "content": "Unmovable Makes the decor like Christmas trees and holidays event trees or thing Ls can’t be moved with buying the shovel please I collect them and don’t want to remove to build a base",
    "score": 5,
    "date": "2025-08-12 19:08:41 UTC",
    "day_of_week": "Tue",
    "process": "unmovable the like and event or thing be with the shovel please i collect them and want to remove to build a base",
    "label": "feature request"
  },
  {
    "content": "Pure Cinema ✋😀🤚 Best of any game In the app store",
    "score": 5,
    "date": "2025-08-12 15:34:50 UTC",
    "day_of_week": "Tue",
    "process": "pure cinema best of any game in the store",
    "label": "positive feedback"
  },
  {
    "content": "To: YE I miss the old Kanye :(",
    "score": 1,
    "date": "2025-08-12 02:16:18 UTC",
    "day_of_week": "Tue",
    "process": "ye i miss the old",
    "label": "positive feedback"
  },
  {
    "content": "Lots of fun Every day is different.",
    "score": 5,
    "date": "2025-08-12 00:54:55 UTC",
    "day_of_week": "Tue",
    "process": "lots of fun every day is different.",
    "label": "positive feedback"
  },
  {
    "content": "Game lâu roiif ko chơi Chơi hay",
    "score": 5,
    "date": "2025-08-11 23:20:08 UTC",
    "day_of_week": "Mon",
    "process": "game ko hay",
    "label": "positive feedback"
  },
  {
    "content": "Worst game ever This game is so bad I hate it thare are so many swets I will find the creator \n\nSleep with one eye open",
    "score": 1,
    "date": "2025-08-11 20:54:39 UTC",
    "day_of_week": "Mon",
    "process": "worst game ever this game is so bad i hate it are so many i will find the creator sleep with one eye open",
    "label": "game problem"
  },
  {
    "content": "It doesn’t let me play I thought I needed to rest my phone and everything I did it but it tells me it failed try again later I keep trying and it still don’t work pls help me.",
    "score": 3,
    "date": "2025-08-11 19:12:34 UTC",
    "day_of_week": "Mon",
    "process": "it let me play i thought i to rest my phone and everything i did it but it me it try again later i keep trying and it still work help me.",
    "label": "game not working"
  },
  {
    "content": "This game is very cool This game is very cool",
    "score": 5,
    "date": "2025-08-11 19:08:03 UTC",
    "day_of_week": "Mon",
    "process": "this game is very cool this game is very cool",
    "label": "positive feedback"
  },
  {
    "content": "Geared towers. Everything is good about clash of clans but I wondered if you can add geared bomb tower and wizard tower in the next update.",
    "score": 5,
    "date": "2025-08-11 18:26:32 UTC",
    "day_of_week": "Mon",
    "process": "geared everything is good about clash of but i if you can add geared bomb tower and wizard tower in the next update.",
    "label": "feature request"
  },
  {
    "content": "I misss how it was I miss the old way. Where troops costed mana and you had to wait. And when they died you needed more. I guess it’s better but I miss having mutiple barracks. Oh well",
    "score": 5,
    "date": "2025-08-11 15:21:13 UTC",
    "day_of_week": "Mon",
    "process": "i how it was i miss the old way. where mana and you had to wait. and when they you more. i guess better but i miss oh well",
    "label": "off-topic joke"
  },
  {
    "content": "Best game It’s really fun when you get the hang of it and make sure you play clash royale to that’s also fun",
    "score": 5,
    "date": "2025-08-11 09:00:58 UTC",
    "day_of_week": "Mon",
    "process": "best game really fun when you get the of it and make sure you play clash royale to also fun",
    "label": "positive feedback"
  },
  {
    "content": "Cómo hago recuperar mi cuenta borraron si querer los de la aplicación y me robaron todo mi dinero lo Mi dinero las compras que así me robaron todo quiero recuperar mi dinero aunque si me van quitar la cuenta ya estoy cansado que siempre me cambio teléfono me robaron todo está es la tercera cuenta me borrar gasté mucho en ella como las otras dos aterrires",
    "score": 1,
    "date": "2025-08-11 05:15:41 UTC",
    "day_of_week": "Mon",
    "process": "mi si de la y me mi dinero lo mi dinero las me mi dinero si me van la ya me me es la me en las dos",
    "label": "positive feedback"
  },
  {
    "content": "I lvl up can’t chose my card I been lvl up and won’t let me chose my cars I’m in arena 11 and won’t let me pick my card and I have invested more tha $100 dollars past few month it’s a scam",
    "score": 1,
    "date": "2025-08-11 03:40:59 UTC",
    "day_of_week": "Mon",
    "process": "i up chose my card i been up and let me chose my in arena and let me pick my card and i have more tha past few month a scam",
    "label": "game not working"
  },
  {
    "content": "Awesome This game is awesome sauce",
    "score": 5,
    "date": "2025-08-11 01:41:08 UTC",
    "day_of_week": "Mon",
    "process": "awesome this game is awesome sauce",
    "label": "positive feedback"
  },
  {
    "content": "The reason I gave a good review I love this game because I used to play it as a child at 7 play it for most of my life and it has a original theme still to this day I play it as a 12 year old.",
    "score": 5,
    "date": "2025-08-11 01:02:22 UTC",
    "day_of_week": "Mon",
    "process": "the reason i gave a good review i love this game because i used to play it as a child at play it for most of my life and it a original theme still to this day i play it as a year old.",
    "label": "positive feedback"
  },
  {
    "content": "Top 5 mobile game oat You just feel entrapped once starting to play and can’t ever get off",
    "score": 5,
    "date": "2025-08-11 00:39:09 UTC",
    "day_of_week": "Mon",
    "process": "top mobile game oat you just feel once starting to play and ever get off",
    "label": "game problem"
  }
]