[
  {
    "content": "OMG 😍 I love the way you always don’t expect it! I say keep the game this is dont change it!! Well it’s one answer why I gave it 5 star ⭐️⭐️⭐️⭐️⭐️ in the Title and it’s just I love how sometimes the ⬅️ means ➡️ and ➡️ means ⬅️ and the ⬆️ means giant jump",
    "score": 5,
    "date": "2025-08-30 01:20:06 UTC",
    "day_of_week": "Sat"
  },
  {
    "content": "Unept’s AMAZING MASTERPIECE.                             DoggyDonuts This game is amazing. With its shooting buzz saws, collapsing cliffs, and other shenanigans, this is my go-to game for when I’m bored, sad, or if I just need some trolling fun. The soundtrack is phenomenal, and the graphics are simple yet perfect. Definitely add more levels to the game! +*+*+*+Suggestions:+*+*+*+ -Add a hard level of the day that changes each time. -Maybe turn down the ads a little bit. I know you have to make money, but you could make people watch an ad to play the level of the day(see above). I am SO GLAD I stumbled upon this gem of a game hidden in a cave of boring rocks. Thank you, Unept!! Bye, DoggyDonuts",
    "score": 5,
    "date": "2025-08-29 21:07:18 UTC",
    "day_of_week": "Fri"
  },
  {
    "content": "Perfect if you like to be surprised I had a great time playing through all the different levels and general chaos of simple level design.",
    "score": 5,
    "date": "2025-08-29 15:08:03 UTC",
    "day_of_week": "Fri"
  },
  {
    "content": "egregious ads egregious, aggressive ads that just constantly harangue you after almost every level.",
    "score": 1,
    "date": "2025-08-29 00:01:14 UTC",
    "day_of_week": "Fri"
  },
  {
    "content": "Too Many Ads This game used to be the best, but now after every level and every time you die, there’s an ad. They have ruined the game by almost forcing you to pay for no ads. Do better",
    "score": 1,
    "date": "2025-08-28 17:29:16 UTC",
    "day_of_week": "Thu"
  },
  {
    "content": "A joy Taken seriously it is a pain but taken tongue in cheek and the game is great!!",
    "score": 2,
    "date": "2025-08-27 15:08:38 UTC",
    "day_of_week": "Wed"
  },
  {
    "content": "One question. How many people work on this game?",
    "score": 5,
    "date": "2025-08-27 13:31:05 UTC",
    "day_of_week": "Wed"
  },
  {
    "content": "🍿🍿🍿 i actually enjoyed playing it 🍿 its a good game to get trolled , yeah but i would recommend playing it at least ones cuz its a cool game \n\nMAKE MORE LEVELS...",
    "score": 5,
    "date": "2025-08-27 12:43:42 UTC",
    "day_of_week": "Wed"
  }
]